artillery/LoadTest.yaml
config:
  target: 'https://gdu1o8etp4.execute-api.us-east-1.amazonaws.com/send_messages'
  phases:
    - duration: 60
      arrivalRate: 100
  processor: "./LoadTestFunction.js"          
scenarios:
  - flow:
    - function: "generateMessages"
    - post:
        url: "/events"
        headers:
            x-api-key: "your-api-key"
        json:
          from: "{{ from }}"
          to: "{{ to }}"
          template_name: "{{ template_name }}"
          user_id: "{{ user_id }}"
          config_set: "{{ config_set }}"
          tags: "{{ tags }}"
          unique_code: "{{ unique_code }}"